# Задача 8: Требуется определить, можно ли от шоколадки размером n
# × m долек отломить k долек, если разрешается сделать один разлом по
# прямой между дольками (то есть разломить шоколадку на два
# прямоугольника).
# 3 2 4 -> yes
# 3 2 1 -> no

# print('Введите колличество долек по вертикали : ', end='')
# n = int(input())
# print('Введите колличество долек по горизонтали : ', end='')
# m = int(input())
# print('Введите колличество отрезаемых долек : ', end='')
# k = int(input())
#
# if k < n * m and ((k % n == 0) or (k % m == 0)):
#     print('YES')
# else:
#     print('NO')
